vlm/base/Documents/бит_АктОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_АктОБраке</Name>
			<Comment>ЛТ9.2</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_БракВозвратСрезкаПродукции</xr:Item>
				<xr:Item>InformationRegister.бит_ИсторияИзмененийСсогласованияАктовОБраке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменныйМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОбнаружения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОперацияОбнаружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатоСогласование</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьФормы</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УспешностьСогласования</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюВосстановление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюОтходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюПеремаркировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийУщербКУдержанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОБраке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНесоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыНесоответствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Восстановление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виновник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлановоУчетная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Восстановление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыОперацийВосстановления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныБрака</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаБрака</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныБрака</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗабракованная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеремаркированоВ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьЗабракованнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьПеремаркированнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/InformationRegisters/бит_ОчередностьЭтаповСогласований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ОчередностьЭтаповСогласований</Name>
			<Comment>Первыйбит ЛТ29 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>бит_НомерЭтапа</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_СтатусДокумента</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_Цех</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_РольИсполнителя</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/Documents/бит_АктОБраке/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Если УспешностьСогласования = -1 Тогда
		УспешностьСогласования = 1
	КонецЕсли;
	
	Если ТекущийСтатус <> Статус и Проведен Тогда 
		ВыполнитьЗаписьВРегистрИстории(Статус);
	КонецЕсли;
	
	Если ПроверкаНачалаСогласования() Тогда 
		ПроверкаУспешностиСогласования(Отказ);
	КонецЕсли;                        
	
	Если ТекущийСтатус = Перечисления.бит_СтатусыОБраке.АктСформированСК и НачатоСогласование = Ложь Тогда
		
		ДатаУстановкиСтатуса = ТекущаяДатаСеанса();
		Движения.бит_ИсторияИзмененийСсогласованияАктовОБраке.Записывать = Истина;
		Движение = Движения.бит_ИсторияИзмененийСсогласованияАктовОБраке.Добавить(); 
		
		Движение.Период = ТекущаяДатаСеанса();
		Движение.бит_Цех = Цех;
		Движение.бит_СтатусДокумента = Статус;
		Движение.бит_Действие = УспешностьСогласования;
		Движение.бит_Исполнитель = Пользователи.ТекущийПользователь();
		Движение.бит_ДатаРегистрацииСтатуса = ДатаРегистрацииСтатуса;
		Движение.бит_ДатаУстановкиСтатуса = ДатаУстановкиСтатуса;
		Движение.бит_Примечание = Примечание;
		
	КонецЕсли;	 
	
	Если не ПроверкаНачалаСогласования() Тогда
		
		НовйБизнесПроцесс = БизнесПроцессы.бит_СогласованиеАктОБраке.СоздатьБизнесПроцесс();
		НовйБизнесПроцесс.Дата = ТекущаяДатаСеанса(); 
		НовйБизнесПроцесс.Предмет  = Ссылка;
		НовйБизнесПроцесс.Автор = Пользователи.ТекущийПользователь();
		НовйБизнесПроцесс.ДатаНачала = ТекущаяДатаСеанса();
		НовйБизнесПроцесс.ДатаЗавершения = ТекущаяДатаСеанса() + 864000;  
		НовйБизнесПроцесс.Статус = Статус; 
		СтрокаРецензии = НовйБизнесПроцесс.Рецензии.Добавить();
		
		НовйБизнесПроцесс.Записать();
		НовйБизнесПроцесс.Старт();  
		ДатаУстановкиСтатуса = ТекущаяДатаСеанса();
		ТекущийСтатус = Статус;
		НачатоСогласование = Истина; 
		ДатаРегистрацииСтатуса = ТекущаяДатаСеанса();
		ДоступностьФормы = Ложь;
		
	КонецЕсли;	    
	
	ДоступностьФормы = Ложь;
	Исполнитель = Пользователи.ТекущийПользователь();
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [03.09.2025 15:53:19] +        
	Если Не Отказ Тогда 
		// найдем виновника. по условиям он должен быть один на весь документ. пустые допускаются, но в движения не попадут.
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
		Запрос.Текст ="ВЫБРАТЬ
		              |	бит_АктОБракеДанныеОБраке.Номенклатура КАК Номенклатура,
		              |	бит_АктОБракеДанныеОБраке.Виновник КАК Виновник
		              |ПОМЕСТИТЬ ДанныеОБраке
		              |ИЗ
		              |	Документ.бит_АктОБраке.ДанныеОБраке КАК бит_АктОБракеДанныеОБраке
		              |ГДЕ
		              |	бит_АктОБракеДанныеОБраке.Ссылка = &Ссылка
		              |	И бит_АктОБракеДанныеОБраке.Виновник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		              |	И бит_АктОБракеДанныеОБраке.Виновник ССЫЛКА Справочник.Сотрудники
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	бит_АктОБракеДанныеОБраке.Номенклатура,
		              |	бит_АктОБракеДанныеОБраке.Виновник
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	ДанныеОБраке.Виновник КАК Виновник
		              |ИЗ
		              |	ДанныеОБраке КАК ДанныеОБраке";   
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		тзВиновник = Запрос.Выполнить().Выгрузить();
		Если тзВиновник.Количество() > 1  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе должен быть только один виновник (ЛТ9.10)");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.бит_БракВозвратСрезкаПродукции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
                      |	бит_АктОБракеВосстановление.Материал КАК Номенклатура,
                      |	СУММА(бит_АктОБракеВосстановление.Количество) КАК ВосстановлениеКоличество,
                      |	СУММА(бит_АктОБракеВосстановление.Сумма) КАК ВосстановлениеСумма
                      |ПОМЕСТИТЬ Восстановление
                      |ИЗ
                      |	Документ.бит_АктОБраке.Восстановление КАК бит_АктОБракеВосстановление
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОБраке КАК ДанныеОБраке
                      |		ПО бит_АктОБракеВосстановление.Материал = ДанныеОБраке.Номенклатура
                      |ГДЕ
                      |	бит_АктОБракеВосстановление.Ссылка = &Ссылка
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	бит_АктОБракеВосстановление.Материал
                      |;
                      |
                      |////////////////////////////////////////////////////////////////////////////////
                      |ВЫБРАТЬ
                      |	бит_АктОБракеОтходы.Материал КАК Материал,
                      |	СУММА(бит_АктОБракеОтходы.Количество) КАК ОтходыКоличество,
                      |	СУММА(бит_АктОБракеОтходы.КУдержанию) КАК ОтходыКУдержанию
                      |ПОМЕСТИТЬ отходы
                      |ИЗ
                      |	ДанныеОБраке КАК ДанныеОБраке
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_АктОБраке.Отходы КАК бит_АктОБракеОтходы
                      |		ПО ДанныеОБраке.Номенклатура = бит_АктОБракеОтходы.Материал
                      |ГДЕ
                      |	бит_АктОБракеОтходы.Ссылка = &Ссылка
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	бит_АктОБракеОтходы.Материал
                      |;
                      |
                      |////////////////////////////////////////////////////////////////////////////////
                      |ВЫБРАТЬ
                      |	ДанныеОБраке.Номенклатура КАК Номенклатура,
                      |	ЕстьNull(Восстановление.ВосстановлениеКоличество,0) КАК ВосстановлениеКоличество,
                      |	ЕстьNull(Восстановление.ВосстановлениеСумма,0) КАК ВосстановлениеСумма,
                      |	ЕстьNull(отходы.ОтходыКоличество,0) КАК ОтходыКоличество,
                      |	ЕстьNull(отходы.ОтходыКУдержанию,0) КАК ОтходыКУдержанию
                      |ИЗ
                      |	ДанныеОБраке КАК ДанныеОБраке
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Восстановление КАК Восстановление
                      |		ПО ДанныеОБраке.Номенклатура = Восстановление.Номенклатура
                      |		ЛЕВОЕ СОЕДИНЕНИЕ отходы КАК отходы
                      |		ПО ДанныеОБраке.Номенклатура = отходы.Материал";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
			НоваяЗапись.Документ = ЭтотОбъект.Ссылка;
			НоваяЗапись.Период = ЭтотОбъект.Дата;
		
			НоваяЗапись.Номенклатура = Выборка.Номенклатура;
			
			НоваяЗапись.Статус 		 = ЭтотОбъект.Статус;
			НоваяЗапись.ВиновноеЛицо = тзВиновник[0].Виновник;
			
			НоваяЗапись.КоличествоИсправимогоБракаПоВинеРаботника 	 = Выборка.ВосстановлениеКоличество;
			НоваяЗапись.СтоимостьИсправимогоБракаПоВинеРаботника 	 = Выборка.ВосстановлениеСумма;
			НоваяЗапись.КоличествоОкончательногоБракаПоВинеРаботника = Выборка.ОтходыКоличество;
			НоваяЗапись.СтоимостьОкончательногоБракаПоВинеРаботника  = Выборка.ОтходыКУдержанию;
		КонецЦикла;          
		НаборЗаписей.Записать();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [03.09.2025 15:53:19] -

КонецПроцедуры 

Функция ПроверкаНачалаСогласования()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СогласованиеАктОБраке.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.бит_СогласованиеАктОБраке КАК бит_СогласованиеАктОБраке
		|ГДЕ
		|	бит_СогласованиеАктОБраке.Предмет = &Предмет
		|	И бит_СогласованиеАктОБраке.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);  
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если   РезультатЗапроса.Количество() > 0 Тогда
		Возврат Истина
	Иначе
		Возврат Ложь;
	КонецЕсли;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецФункции	

Процедура ВыполнитьЗаписьВРегистрИстории(Статус)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Попытка	
		Набор = РегистрыСведений.бит_ИсторияИзмененийСсогласованияАктовОБраке.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Ссылка);
		Запись = Набор.Добавить();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.бит_Цех = Цех;
		Запись.бит_Исполнитель = Пользователи.ТекущийПользователь();
		Запись.бит_Действие = УспешностьСогласования;
		Запись.бит_ДатаРегистрацииСтатуса = ДатаРегистрацииСтатуса;
		Запись.бит_ДатаУстановкиСтатуса = ТекущаяДатаСеанса();             
		Запись.бит_СтатусДокумента = Статус;
		Запись.бит_Примечание = Примечание;
		Набор.Записать(Ложь); 
	Исключение
		ТекстСообщения = "Не удалось провести документ с таким набором данных!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки; 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -	
КонецПроцедуры

Процедура ПроверкаУспешностиСогласования(Отказ)  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа КАК бит_НомерЭтапа,
		|	бит_ОчередностьЭтаповСогласований.бит_СтатусДокумента КАК бит_СтатусДокумента
		|ИЗ
		|	РегистрСведений.бит_ОчередностьЭтаповСогласований КАК бит_ОчередностьЭтаповСогласований
		|ГДЕ
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа <> 0 
		|	И (бит_ОчередностьЭтаповСогласований.бит_Цех = &Цех
		|			ИЛИ бит_ОчередностьЭтаповСогласований.бит_Цех = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа";
	
	Запрос.УстановитьПараметр("Цех", Цех);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НомерЭтапа = - 1; 
	Итератор = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = ТекущийСтатус
			И  НомерЭтапа < 0 Тогда 
			ВыборкаДетальныеЗаписи.Следующий();
			Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = Статус Тогда
				ЭтапВыполнен();
				Прервать;
			ИначеЕсли НомерЭтапа < 0 Тогда 
				НомерЭтапа = ВыборкаДетальныеЗаписи.бит_НомерЭтапа;
				ВыборкаДетальныеЗаписи.Сбросить();
				Итератор = Итератор +1;
			КонецЕсли;
			
		КонецЕсли;
		Если НомерЭтапа > 0 И 
			ВыборкаДетальныеЗаписи.бит_НомерЭтапа = НомерЭтапа - 2 Тогда
			Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = Статус Тогда
				ЭтапНеВыполнен();
				Прервать;
			Иначе 
				ТекстСообщения = "Статус указан не верно!";
				Отказ = Истина;  
				бит_ДоступностьФормы = Истина;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		Если Итератор > 20 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры 

Процедура ЭтапВыполнен()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +				
	ТекущаяЗадача = ПолучитьЗадачу();
	Если Не ТекущаяЗадача = Неопределено Тогда 
		ТекущаяЗадача = ТекущаяЗадача.ПолучитьОбъект(); 
		ТекущаяЗадача.Исполнитель = Пользователи.ТекущийПользователь();
		ТекущаяЗадача.Дата = ТекущаяДатаСеанса();
		ТекущаяЗадача.ДатаИсполнения = ТекущаяДатаСеанса();
		ТекущаяЗадача.ВыполнитьЗадачу();  
		УспешностьСогласования = 1;
		ТекущийСтатус = Статус;
	КонецЕсли;
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры	
	
Процедура ЭтапНеВыполнен()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	УспешностьСогласования = 0;
    ВыполнитьЗаписьВРегистрИстории(ТекущийСтатус);
	ЗаполнитьПрошлыйЭтап();
	ТекущаяЗадача = ПолучитьЗадачу();
	Если Не ТекущаяЗадача = Неопределено Тогда 
		ТекущаяЗадача = ТекущаяЗадача.ПолучитьОбъект(); 
		БизнесПроцесс = ТекущаяЗадача.БизнесПроцесс.ПолучитьОбъект();
		БизнесПроцесс.Статус = Статус; 
		БизнесПроцесс.Записать();
		ТекущаяЗадача.Исполнитель = Пользователи.ТекущийПользователь();
		ТекущаяЗадача.ДатаИсполнения = ТекущаяДатаСеанса();
		ТекущаяЗадача.ВыполнитьЗадачу();
	КонецЕсли;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры

Функция  ПолучитьЗадачу() 
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Предмет = &Ссылка
		|	И ЗадачаИсполнителя.Выполнена = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаИсполнителя.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		ВыборкаДетальныеЗаписи.Следующий();  
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецФункции	

Процедура ЗаполнитьПрошлыйЭтап()
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа КАК бит_НомерЭтапа,
		|	бит_ОчередностьЭтаповСогласований.бит_СтатусДокумента КАК бит_СтатусДокумента
		|ИЗ
		|	РегистрСведений.бит_ОчередностьЭтаповСогласований КАК бит_ОчередностьЭтаповСогласований
		|ГДЕ
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа <> 0
		|	И (бит_ОчередностьЭтаповСогласований.бит_Цех = &Цех
		|			ИЛИ бит_ОчередностьЭтаповСогласований.бит_Цех = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа";
	
	Запрос.УстановитьПараметр("Цех", Цех);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = Статус Тогда
			НомерЭтапа = ВыборкаДетальныеЗаписи.бит_НомерЭтапа;
			ВыборкаДетальныеЗаписи.Сбросить();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.бит_НомерЭтапа = НомерЭтапа - 1 Тогда
			ТекущийСтатус = ВыборкаДетальныеЗаписи.бит_СтатусДокумента;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -		  
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	ТекущийСтатус = Перечисления.бит_СтатусыОБраке.АктСформированСК;
	
	Если  ПроверкаНачалаСогласования() Тогда 
		
		ТекущаяЗадача = ПолучитьЗадачу();
		Если Не ТекущаяЗадача = Неопределено Тогда 
			ТекущаяЗадача = ТекущаяЗадача.ПолучитьОбъект(); 
			БизнесПроцесс = ТекущаяЗадача.БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцесс.ПометкаУдаления = Истина;
			БизнесПроцесс.Записать();
		КонецЕсли;
		
	КонецЕсли;
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры
